{
  "id": "Brodmannniigz_70",
  "name": "Brodmann Area 19 (Visual Association Cortex)",
  "ba_label": "BA19",
  "description": "Brodmann Area 19 (Visual Association Cortex) - 正常な視力を持つヒトにおいて、特徴抽出、形状認識、注意、および多感覚統合機能を持つ視覚連合野です。この領域は、V3、V4、V5（中側頭野、またはMTとしても知られる）、およびV6（背内側野としても知られる）といった視覚領域の領域を含むとされています。機能的磁気共鳴画像法（fMRI）は、BA19内に様々な網膜局所マップの存在を示しています。BA19は、上丘および視床枕を介して網膜からの入力を受け取り",
  "location": "ヒトの脳の後頭葉皮質の一部であり、領域18とともに外線条体皮質（または傍線条体皮質）を構成します。具体的には、舌状回、楔部、外側後頭回（H）、および上後頭回（H）の一部に位置し、頭頂後頭溝によっておおよそ境界されています。片側では、BA19が囲む傍線条体領域18によって境界されています。吻側では、角回領域39（H）と後頭側頭領域37（H）によって境界されています。細胞構築学的には、BA18と比較して、外錐体層（III）のサブレイヤー3bの錐体細胞の分布密度は低く、層は狭くなく、内顆粒層（IV）との境界はそれほど明確ではありません。サブレイヤー3bの細胞は外側境界に集中しており、層IVに隣接する大きな錐体細胞のない狭い透明帯を残しています。層IVの顆粒細胞は分布密度が低く、より大きな多形細胞と混在しているため、層は依然としてかなり暗く目立ちますが、やや広がり、それほど自己完結的ではありません。内錐体層（V）は、小さなグループに分けられた大きな錐体神経節細胞によって特徴付けられ、これは領域18では見られないパターンです。多形層（VI）の細胞は領域18よりも明らかに大きく、全体として、領域19は領域18よりもやや厚く、細胞密度が低いです。",
  "function": "正常な視力を持つヒトにおいて、特徴抽出、形状認識、注意、および多感覚統合機能を持つ視覚連合野です。この領域は、V3、V4、V5（中側頭野、またはMTとしても知られる）、およびV6（背内側野としても知られる）といった視覚領域の領域を含むとされています。機能的磁気共鳴画像法（fMRI）は、BA19内に様々な網膜局所マップの存在を示しています。BA19は、上丘および視床枕を介して網膜からの入力を受け取り、盲視の現象に寄与する可能性があります。幼少期から盲目の患者では、この領域が体性感覚刺激によって活性化されることが判明しています。これらの発見から、BA19は「何」と「どこ」の2つの視覚経路の分化点であると考えられています。背側領域には運動感受性ニューロンが含まれる可能性があり、腹側領域は物体認識に特化している可能性があります。",
  "band_pass_characteristics": {
    "delta": {
      "frequency_range": "0.5-4 Hz",
      "description": "Deep sleep, unconscious states",
      "characteristics": "ScienceDirectの概要ページによると、BA19は感覚皮質領域に位置し、デルタ波の周波数帯域で局所化されることが示されています。EEG研究において、BA19は他のブロードマン領域と同様にデルタ周波数帯域で活動が観察されます。"
    },
    "theta": {
      "frequency_range": "4-8 Hz",
      "description": "Meditation, memory processing, light sleep",
      "characteristics": "EEG研究において、BA19は他のブロードマン領域と同様にシータ周波数帯域で活動が観察されます。特に、解離性エピソード中のEEG研究では、BA17/18/19領域においてシータ帯域での活動増加が報告されています。"
    },
    "alpha": {
      "frequency_range": "8-13 Hz",
      "description": "Relaxed wakefulness, reduced mental effort",
      "characteristics": "EEG研究において、BA19は他のブロードマン領域と同様にアルファ周波数帯域で活動が観察されます。特に、解離性エピソード中のEEG研究では、BA17/18/19領域においてアルファ帯域での活動増加が報告されています。"
    },
    "beta": {
      "frequency_range": "13-30 Hz",
      "description": "Active thinking, focus, problem-solving",
      "characteristics": "EEG研究において、BA19は他のブロードマン領域と同様にベータ周波数帯域で活動が観察されます。特に、解離性エピソード中のEEG研究では、BA17/18/19領域においてベータ帯域での活動増加が報告されています。"
    },
    "gamma": {
      "frequency_range": "30-100+ Hz",
      "description": "High-level cognition, learning, memory formation",
      "characteristics": "EEG研究において、BA19は他のブロードマン領域と同様にガンマ周波数帯域で活動が観察されます。"
    }
  },
  "connections": [
    "BA17 (V1)",
    "BA18 (V2)",
    "BA19",
    "Visual thalamus",
    "Superior colliculus"
  ],
  "connectivity_pattern": "BA19を構成する多様な領域は、領域17および18、ならびに後部頭頂および下側頭連合野と相互に結合しています。BA19は、複数のゾーン（V2, V3, V4, V5, V6）に細分化され、それぞれが異なる接続パターンを持っています。これらのゾーンは、領域17および18、ならびに後部頭頂および下側頭連合野と相互に接続しています。特に、視空間ワーキングメモリに関与する右側優位のネットワークの一部であり、記憶課題中の内部視覚イメージの生成に後頭皮質活動が反映されます。",
  "clinical_significance": "BA19の病変は、同時失認やバリン症候群などの視覚性注意障害と関連しており、空間処理および注意処理におけるその役割が強調されています。BA19はまた、滑動性眼球運動にも寄与しており、BA19、37、39を含む後頭側頭頭頂接合部から皮質信号が発生します。電気生理学的および神経画像研究では、BA19が反復プライミングや視覚単語幹補完課題中の神経活動の低下と関連付けられています。さらに、BA19の興奮は、臨床集団における複雑な視覚性幻覚に関与しているとされています。顔処理に関与する後頭顔領域は、ブロードマン領域18または19内に位置します。両側性のBA19病変、特に背外側後頭葉および頭頂後頭接合部の病変は、バリン症候群の特徴であり、同時失認や視性運動失調を含む視覚性注意および行動に重度の欠陥を呈します。これらの病変は、後頭側頭領域にも広がり、視野欠損や視覚失認を引き起こす可能性があります。同時失認は主に両側性の頭頂および頭頂後頭病変（BA19を含む）に起因するとされています。視覚失認（統覚型および連合型）は、後頭および後頭側頭領域、特にブロードマン領域17、18、19の両側性病変と関連しています。統覚型失認は知覚を障害し、連合型失認は視覚からの意味的表現を計算する能力を障害します。ビジュアルスノウ症候群（VSS）の神経画像研究では、右舌状回（BA19の一部）の代謝亢進と、舌状回と紡錘状回接合部付近の灰白質体積の増加が示されています。統合失調症では、BA19における皮質代謝率と体積の減少が観察されており、対照群と比較して代謝活動が低く、これらの変化は視覚性注意欠陥および視覚処理障害と関連しています。",
  "vertices": 18059,
  "hemisphere": "Left"
}