{
  "id": "Brodmannniigz_64",
  "name": "Brodmann Area 40 (Supramarginal Gyrus)",
  "ba_label": "BA40",
  "description": "Brodmann Area 40 (Supramarginal Gyrus) - BA40の縁上回部分は、意味と音韻の両方に関する読解に関与しています。BA40/縁上回の吻側部分の細胞構築学的に定義された下位領域には、PF、PFcm、PFm、PFop、PFtがあります。PF領域はマカクザルのPF領域のホモログであり、ミラーニューロンシステムの一部であり、ヒトの模倣中に活動します。BA40は下頭頂多感覚連合皮質の主要な構成要素であり、感覚モダリティの統合に関与しています。音韻、読",
  "location": "ブロードマン領域40（BA40）は、ヒトの脳の頭頂皮質の一部であり、下頭頂小葉（IPL）内に位置する縁上回に相当します。側頭裂の後端に位置し、下頭頂小葉の前方部分を形成します。解剖学的には、内頭頂溝、下中心後溝、後下中心溝、外側溝によっておおよそ境界が定められています。尾側は角回39野、吻側および背側は尾側中心後野2、腹側は下中心野43および上側頭野22（ブロードマン-1909）によって境界が定められています。BA40の細胞構築は、すべての皮質層に比較的小さなニューロンが存在し、V層とVI層は細胞密度が低く、II層とIV層は広く、顕著で微細な柱状の細胞配列が特徴です。BA40は、PF、PFop（弁蓋部）、PFt（薄い皮質帯）、PFm（大細胞部）、PFcm（大細胞柱状部）などの複数の細胞構築領域に細分されます。",
  "function": "BA40の縁上回部分は、意味と音韻の両方に関する読解に関与しています。BA40/縁上回の吻側部分の細胞構築学的に定義された下位領域には、PF、PFcm、PFm、PFop、PFtがあります。PF領域はマカクザルのPF領域のホモログであり、ミラーニューロンシステムの一部であり、ヒトの模倣中に活動します。BA40は下頭頂多感覚連合皮質の主要な構成要素であり、感覚モダリティの統合に関与しています。音韻、読解、綴りなどの受容言語処理、および量や数などの抽象概念の空間的・象徴的表現に関与しています。顔と手の協調運動に寄与する可能性があります。音韻的短期記憶の「貯蔵」要素の重要な神経基盤です。追跡眼球運動と固視の制御、空間的注意、感覚運動協調に関与しています。BA40は二次体性感覚皮質（SII）の一部を形成し、一次体性感覚皮質と視床からの入力を受け、体性感覚情報を他の感覚モダリティと統合します。BA40の前方部分の活動は、道具使用行動の実行と観察と相関しています。",
  "band_pass_characteristics": {
    "delta": {
      "frequency_range": "0.5-4 Hz",
      "description": "Deep sleep, unconscious states",
      "characteristics": "BA40（中心後回）におけるDelta波（0.5-4Hz）活動の増加は、アルツハイマー病患者において健常対照群と比較して観察されています。また、深い睡眠や一部の異常なプロセスと関連しており、共感にも関与しています。睡眠開始移行期の研究では、BA40におけるDelta帯域の活性化が示されています。"
    },
    "theta": {
      "frequency_range": "4-8 Hz",
      "description": "Meditation, memory processing, light sleep",
      "characteristics": "BA40（下頭頂小葉）におけるTheta波（4-8Hz）活動の増加は、アルツハイマー病患者において観察されています。小児の覚醒時EEGにおけるTheta波は、夕方により広範囲に広がり、反応時間の遅延と関連しています。ACCとBA40間のTheta位相同期が観察されています。BA40に局所化されたTheta波活動の遅延は、認知処理の低下や社会的合図の処理・統合の困難と関連しており、ニューロフィードバックの対象となることがあります。"
    },
    "alpha": {
      "frequency_range": "8-13 Hz",
      "description": "Relaxed wakefulness, reduced mental effort",
      "characteristics": "BA40におけるAlpha波（8-13Hz）の活動は、アノード経頭蓋直流刺激によって増加することが観察されています。また、BA40に局所化されたAlpha波活動の低下は、認知処理の低下や社会的合図の処理・統合の困難と関連しており、ニューロフィードバックの対象となることがあります。一般的に、Alpha波は目を閉じてリラックスした覚醒状態と関連しています。"
    },
    "beta": {
      "frequency_range": "13-30 Hz",
      "description": "Active thinking, focus, problem-solving",
      "characteristics": "ブロードマン領域40（左下頭頂小葉）におけるBeta-1活動の増加は、LORETA分析によって明らかにされています。また、左縁上回（BA40）におけるBetaバーストは、記憶符号化のための注意配分と関連しています。"
    },
    "gamma": {
      "frequency_range": "30-100+ Hz",
      "description": "High-level cognition, learning, memory formation",
      "characteristics": "40Hzのガンマ脳活動に関する一般的な情報（例：集中力のためのバイノーラルビート）は存在しますが、BA40の機能や臨床的意義に直接関連するガンマ波の具体的な特性に関する詳細な研究は、提供された検索結果には明示されていません。しかし、左縁上回（BA40）における高ガンマバーストは、記憶符号化のための注意配分との関連で言及されています。"
    }
  },
  "connections": [
    "BA5",
    "BA7",
    "Prefrontal cortex",
    "Premotor cortex"
  ],
  "connectivity_pattern": "BA40は複雑な構造的および機能的結合パターンを示します。内側側頭葉領域、前頭皮質、側頭皮質と強固な結合があります。短い連合線維が縁上回（BA40）と角回（BA39）を相互に結合しています。下頭頂小葉は後頭頂皮質の腹側に位置し、吻側は中心後溝、背側は内頭頂溝に接しています。BA40は音韻的ワーキングメモリ課題中に活性化されます。",
  "clinical_significance": "BA40の病変、特に左下頭頂小葉の病変は、伝導性失語症（流暢な発話、良好な理解、劣悪な反復、パラグラマティックな誤り、失名詞、音韻性錯語）と関連しています。BA40はウェルニッケ野の一部でもあり、この領域の病変はウェルニッケ失語症（理解、命名、反復、読み書き能力の障害）に寄与する可能性があります。空間性無視や注意障害は、BA40を含む下頭頂小葉の損傷または機能不全と頻繁に関連しています。縁上回の構造的損傷は無視に非常に特異的です。構成失行の原因となる中心病変は、左縁上回（BA40）の前方部分にあります。BA40に局所化されたAlpha波またはTheta波活動の遅延は、認知処理の低下や社会的合図の処理・統合の困難と相関しています。病変研究は、BA40付近の損傷が夢の全体的な停止につながり、視空間能力と心的イメージの低下を伴うことを示しています。",
  "vertices": 5587,
  "hemisphere": "Left"
}